# Commonly used brews and casks
brew "git"
brew "jq"
brew "fzf"
brew "wget"
brew "zip"

cask "google-chrome"

# Shell
brew "fish"
brew "fisher"

# Dev tools
brew "ansible"
brew "awscli"
brew "packer"
brew "terraform"
brew "terragrunt"
brew "infracost"
brew "yarn"
brew "python"

# Console Tools
brew "btop"
brew "asdf"
brew "prettyping"

cask "iterm2"
cask "visual-studio-code"

cask "postman"
cask "studio-3t"

# Desktop
cask "setapp"
cask "alt-tab"
cask "raycast"
cask "google-drive"
cask "bitwarden"

cask "spotify"
cask "obsidian"

cask "telegram-desktop"
cask "whatsapp"
cask "discord"
cask "zoom"

cask "jdownloader"
cask "qbittorrent"
cask "the-unarchiver"
cask "vlc"

cask "steam"